app/views/pages/_column.html.erb

      <div style="padding: 10px;">
        <% column.stickies.each do |sticky| %>
---
SELECT "stickies".* FROM "stickies" WHERE ("stickies".column_id = 2)