app/controllers/columns_controller.rb

SELECT "columns".* FROM "columns"
---
  def index
    @columns = Column.all

SELECT "columns".* FROM "columns" WHERE "columns"."id" = 1 LIMIT 1
---
  def show
    @column = Column.find(params[:id])

INSERT INTO "columns" ("name", "description", "column_order", "created_at", "updated_at") VALUES ('Working', 'The tasks that is being working on.', 2, '2014-03-29 22:09:54.361000', '2014-03-29 22:09:54.361000')
---
  def create
    @column = Column.new(params[:column])

    respond_to do |format|
      if @column.save