app/controllers/pages_controller.rb

SELECT "columns".* FROM "columns" ORDER BY column_order
---
  def home
    @title = "Home"

    @columns = Column.all(:order => "column_order")