app/controllers/users_controller.rb

SELECT "users".* FROM "users" LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "users"
---
  def index
    @users = User.paginate(:page => params[:page])

INSERT INTO "users" ("name", "email", "created_at", "updated_at", "encrypted_password", "salt", "admin") VALUES ('admin', 'allench86@gmail.com', '2014-03-28 05:07:32.948000', '2014-03-28 05:07:32.948000', 'b9f4ac055417fe4daea932bc2868f9a2b3a04309fe7accef2df6ef330ed63e98', 'abd83e0158c5b18e97e24d25614b1a5674e3d2770494a3a5d84e1987417de101', 'f')
---
  def create
    @user = User.new(params[:user])
    if @user.save

UPDATE "users" SET "name" = 'New Name', "email" = 'user@example.org', "salt" = 'd8bb4dca6f6ee48bcefe377294678f37eea47e29023e9da65f806e8b77a62f5c', "encrypted_password" = '69c4efccede6db51ceb6d734573303a8a468f8ba09dc6d6ca82f63e93d52e0bb', "updated_at" = '2014-03-28 05:00:08.911000' WHERE "users"."id" = 1
---
  def update
    if @user.update_attributes(params[:user])