app/views/stickies/_form.html.erb

    <%= f.label :column_id %><br />
    <%= f.select :column_id, Column.all.collect {|x| [x.name, x.id]}, {}, :multiple => false %>
---
SELECT "columns".* FROM "columns"